In [1]:
import pandas as pd

In [5]:
df = pd.read_csv("./src/datalake/code/raw/Sample.csv")

In [6]:
df.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 106 entries, 0 to 105
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    106 non-null    object
 1   last_name     106 non-null    object
 2   company_name  106 non-null    object
 3   address       106 non-null    object
 4   city          106 non-null    object
 5   state         106 non-null    object
 6   zip           106 non-null    int64
 7   phone1        106 non-null    object
 8   phone2        106 non-null    object
 9   email         106 non-null    object
 10  department    106 non-null    object
dtypes: int64(1), object(10)
memory usage: 71.7 KB

In [17]:
df[df["state"]=="LA"]

,first_name,last_name,company_name,address,city,state,zip,phone1,phone2,email,department
0,James,Butt,"Benton, John B Jr",6649 N Blue Gum St,New Orleans,LA,70116,504-621-8927,504-845-1427,jbutt@gmail.com,Sales
1,James,Butt,"Benton, John B Jr",6649 N Blue Gum St,New Orleans,LA,70116,504-621-8927,504-845-1427,jbutt@gmail.com,Marketing
38,Solange,Shinko,"Mosocco, Ronald A",426 Wolf St,Metairie,LA,70002,504-979-9175,504-265-8174,solange@shinko.com,Purchasing
105,Arlene,Klusman,Beck Horizon Builders,3 Secor Rd,New Orleans,LA,70112,504-710-5840,504-946-1807,arlene_klusman@gmail.com,Marketing

In [15]:
df[["company_name"]].describe()

             company_name
count                 106
unique                100
top     Benton, John B Jr
freq                    2

In [16]:
df[["department"]].describe()

       department
count         106
unique          7
top     Marketing
freq           23